// Напишите программу, которая задаёт массив из N элементов, заполненных случайными числами из [a, b) и выводит их на экран.

void RandArray ()
{
    int [] arr = new int [arr.Length];

    for (int i=0; i<arr.Length; i++);
    {
        arr [i] = new Random().Next[1,0];
        Console.write("{0} ", arr[i]);
      }
      Console.WriteLine();
}

RandArray ();